// // ---------------------------------------------------------------1)
// let number = 4
// if (number % 2 === 0 && number !== 0) {
//     console.log("Число четный и не равняется нулю");
//     };



// // ---------------------------------------------------------------2)
// let ask = prompt('Введите число')
// if (ask<=100 && ask>=10){
//     console.log("Число принадлежит от 10 до 100");
// }
// else{
//     console.log("Число не принадлежит от 10 до 100");
// }



// --------------------------------------------------------------------3)
// let number2 = 12
// if (number2 % 2 === 0 && number2 >=10) {
//     console.log("Число является четным и больше 10");
//     }
// else{
//     console.log("Число не является четным и больше 10");        
//     }



//---------------------------------------------------------------------4)
// let a = 11
// let b = 6
// if (a % 2 === 0 && b % 2 === 0 ) {
//     console.log(a-b);
// }else if (a % 2 === 1 && b % 2 === 1 ){
//     console.log(a+b);
// }else{
//     console.log(a,b);
// }



//--------------------------------------------------------------------5)
// 1-true
// 2-true
// 3-true
// 4-true
// 5-undefined



//--------------------------------------------------------------------6)
// let arr = [Mers, Bmw, Audi, Honda, Kia];
// arr[2] = "Huydai"
// arr[-1] = "Nissan"
// console.log(arr);
// console.log(arr.length);